export const list = [
  {
    content_id: 5404,
    title: '乐园遗落之花',
    effect: [
      {
        key: '两件套',
        value: '元素精通提高80点。',
      },
      {
        key: '四件套',
        value:
          '装备者绽放、超绽放、烈绽放反应造成的伤害提升40%。此外，装备者触发绽放、超绽放、烈绽放后，上述效果带来的加成提升25%，该效果持续10秒，至多叠加4次，每1秒至多触发一次。装备者处于队伍后台时依然能触发该效果。',
      },
    ],
  },
  {
    content_id: 5403,
    title: '沙上楼阁史话',
    effect: [
      {
        key: '两件套：',
        value: '获得15%风元素伤害加成。',
      },
      {
        key: '四件套：',
        value:
          '重击命中敌人后，该角色的普通攻击速度提升10%，普通攻击、重击与下落攻击造成的伤害提升40%，持续15秒。',
      },
    ],
  },
  {
    content_id: 4341,
    title: '深林的记忆',
    effect: [
      {
        key: '两件套：',
        value: '获得15%草元素伤害加成。',
      },
      {
        key: '四件套：',
        value:
          '元素战技或元素爆发命中敌人后，使命中目标的草元素抗性降低30%，持续8秒。装备者处于队伍后台时，依然能触发该效果。',
      },
    ],
  },
  {
    content_id: 4335,
    title: '饰金之梦',
    effect: [
      {
        key: '两件套：',
        value: '元素精通提高80点。',
      },
      {
        key: '四件套：',
        value:
          '触发元素反应后的8秒内，会根据队伍内其他角色的元素类型，使装备者获得强化：队伍中每存在1个和装备者同类元素的角色，攻击力提升14%；每存在1个和装备者不同元素类型的角色，元素精通提升50点。上述每类效果至多计算3个角色。该效果每8秒至多触发一次。装备者处于队伍后台时，依然能触发该效果。',
      },
    ],
  },
  {
    content_id: 3867,
    title: '辰砂往生录',
    effect: [
      {
        key: '两件套：',
        value: '攻击力提高18%。',
      },
      {
        key: '四件套：',
        value:
          '施放元素爆发后，将产生持续16秒的「潜光」效果：攻击力提升8%；并在角色的生命值降低时，攻击力进一步提升10%，至多通过这种方式提升4次，每0.8秒至多触发一次。「潜光」效果将在角色退场时消失；持续期间再次施放元素爆发，将移除原有的「潜光」。',
      },
    ],
  },
  {
    content_id: 3866,
    title: '来歆余响',
    effect: [
      {
        key: '两件套：',
        value: '攻击力提高18%。',
      },
      {
        key: '四件套：',
        value:
          '普通攻击命中敌人时，有36%概率触发「幽谷祝祀」：普通攻击造成的伤害提高，伤害提高值为攻击力的70%，该效果将在普通攻击造成伤害后的0.05秒后清除。普通攻击未触发「幽谷祝祀」时，会使下次触发概率提升20%；0.2秒内至多判定1次触发与否。',
      },
    ],
  },
  {
    content_id: 3158,
    title: '华馆梦醒形骸记',
    effect: [
      {
        key: '两件套：',
        value: '防御力提高30%。',
      },
      {
        key: '四件套：',
        value:
          '装备此圣遗物套装的角色在以下情况下，将获得「问答」效果：在场上用岩元素攻击命中敌人后获得一层，每0.3秒至多触发一次；在队伍后台中，每3秒获得一层。问答至多叠加4层，每层能提供6%防御力与6%岩元素伤害加成。每6秒,若未获得问答效果，将损失一层。',
      },
    ],
  },
  {
    content_id: 3157,
    title: '海染砗磲',
    effect: [
      {
        key: '两件套：',
        value: '治疗加成提高15%。',
      },
      {
        key: '四件套：',
        value:
          '装备此圣遗物套装的角色对队伍中的角色进行治疗时，将产生持续3秒的海染泡沫，记录治疗的生命值回复量（包括溢出值）。持续时间结束时，海染泡沫将会爆炸，对周围的敌人造成90%累计回复量的伤害（该伤害结算方式同感电、超导等元素反应，但不受元素精通、等级或反应伤害加成效果影响）。每3.5秒至多产生一个海染泡沫；海染泡沫至多记录30000点回复量，含溢出部分的治疗量；自己的队伍中同时至多存在一个海染泡沫。装备此圣遗物套装的角色处于队伍后台时；依然能触发该效果。',
      },
    ],
  },
  {
    content_id: 2322,
    title: '绝缘之旗印',
    effect: [
      {
        key: '两件套：',
        value: '元素充能效率提高20%。',
      },
      {
        key: '四件套：',
        value:
          '基于元素充能效率的25%，提高元素爆发造成的伤害。至多通过这种方式获得75%提升。',
      },
    ],
  },
  {
    content_id: 2321,
    title: '追忆之注连',
    effect: [
      {
        key: '两件套：',
        value: '攻击力提高18%。',
      },
      {
        key: '四件套：',
        value:
          '释放元素战技时，如果角色的元素能量高于或等于15点，则会流失15点元素能量，使接下来的10秒内，普通攻击、重击、下落攻击造成的伤害提高50%，持续期间内效果不会再次触发。',
      },
    ],
  },
  {
    content_id: 1984,
    title: '千岩牢固',
    effect: [
      {
        key: '两件套：',
        value: '生命值提升20%',
      },
      {
        key: '四件套：',
        value:
          '元素战技命中敌人后，使队伍中附近的所有角色攻击力提升20%，护盾强效提升30%，持续3秒。该效果每0.5秒至多触发一次。装备此圣遗物套装的角色处于队伍后台时，依然能触发该效果。',
      },
    ],
  },
  {
    content_id: 1983,
    title: '苍白之火',
    effect: [
      {
        key: '两件套：',
        value: '造成的物理伤害提高25%。',
      },
      {
        key: '四件套：',
        value:
          '元素战技命中敌人后，攻击力提升9%。该效果持续7秒，至多叠加2层，每0.3秒至多触发一次。叠满2层时，2件套的效果提升100%。',
      },
    ],
  },
  {
    content_id: 1639,
    title: '平息鸣雷的尊者',
    effect: [
      {
        key: '两件套：',
        value: '雷元素抗性提高40%。',
      },
      {
        key: '四件套：',
        value: '对处于雷元素影响下的敌人造成的伤害提升35%。',
      },
    ],
  },
  {
    content_id: 1563,
    title: '炽烈的炎之魔女',
    effect: [
      {
        key: '两件套：',
        value: '获得15%火元素伤害加成。',
      },
      {
        key: '四件套：',
        value:
          '超载、燃烧、烈绽放反应造成的伤害提升40%，蒸发、融化反应的加成系数提高15%。施放元素战技后的10秒内，2件套的效果提高50%，该效果最多叠加3次。',
      },
    ],
  },
  {
    content_id: 1638,
    title: '流浪大地的乐团',
    effect: [
      {
        key: '两件套：',
        value: '元素精通提高80点。',
      },
      {
        key: '四件套：',
        value:
          '装备该圣遗物套装的角色为法器、弓箭角色时，角色重击造成的伤害提高35%。',
      },
    ],
  },
  {
    content_id: 1637,
    title: '染血的骑士道',
    effect: [
      {
        key: '两件套：',
        value: '造成的物理伤害提高25%。',
      },
      {
        key: '四件套：',
        value:
          '击败敌人后的10秒内，施放重击时不消耗体力，且重击造成的伤害提升50%。',
      },
    ],
  },
  {
    content_id: 1636,
    title: '被怜爱的少女',
    effect: [
      {
        key: '两件套：',
        value: '角色造成的治疗效果提升15%。',
      },
      {
        key: '四件套：',
        value:
          '施放元素战技或元素爆发后的10秒内，队伍中所有角色受治疗效果加成提高20%。',
      },
    ],
  },
  {
    content_id: 1633,
    title: '角斗士的终幕礼',
    effect: [
      {
        key: '两件套：',
        value: '攻击力提高18%。',
      },
      {
        key: '四件套：',
        value:
          '装备该圣遗物套装的角色为单手剑、双手剑、长柄武器角色时，角色普通攻击造成的伤害提高35%。',
      },
    ],
  },
  {
    content_id: 1602,
    title: '渡过烈火的贤人',
    effect: [
      {
        key: '两件套：',
        value: '火元素抗性提高40%。',
      },
      {
        key: '四件套：',
        value: '对处于火元素影响下的敌人造成的伤害提升35%。',
      },
    ],
  },
  {
    content_id: 1600,
    title: '悠古的磐岩',
    effect: [
      {
        key: '两件套：',
        value: '获得15%岩元素伤害加成。',
      },
      {
        key: '四件套：',
        value:
          '获得结晶反应形成的晶片时，队伍中所有角色获得35%对应元素伤害加成，持续10秒。同时只能通过该效果获得一种元素伤害加成。',
      },
    ],
  },
  {
    content_id: 1632,
    title: '如雷的盛怒',
    effect: [
      {
        key: '两件套：',
        value: '获得15%雷元素伤害加成。',
      },
      {
        key: '四件套：',
        value:
          '超载、感电、超导、超绽放反应造成的伤害提升40%，超激化反应带来的伤害提升提高20%。触发上述元素反应或原激化反应时，元素战技冷却时间减少1秒。该效果每0.8秒最多触发一次。',
      },
    ],
  },
  {
    content_id: 1628,
    title: '沉沦之心',
    effect: [
      {
        key: '两件套：',
        value: '获得15%水元素伤害加成。',
      },
      {
        key: '四件套：',
        value: '施放元素战技后的15秒内，普通攻击与重击造成的伤害提高30%。',
      },
    ],
  },
  {
    content_id: 1601,
    title: '逆飞的流星',
    effect: [
      {
        key: '两件套：',
        value: '护盾强效提高35%。',
      },
      {
        key: '四件套：',
        value: '处于护盾庇护下时，额外获得40%普通攻击和重击伤害加成。',
      },
    ],
  },
  {
    content_id: 1631,
    title: '昔日宗室之仪',
    effect: [
      {
        key: '两件套：',
        value: '元素爆发造成的伤害提升20％。',
      },
      {
        key: '四件套：',
        value:
          '释放元素爆发后，队伍中所有角色攻击力提升20％，持续12秒，该效果不可叠加。',
      },
    ],
  },
  {
    content_id: 1630,
    title: '翠绿之影',
    effect: [
      {
        key: '两件套：',
        value: '获得15%风元素伤害加成。',
      },
      {
        key: '四件套：',
        value:
          '扩散反应造成的伤害提升60%。根据扩散的元素类型，降低受到影响的敌人40%的对应元素抗性，持续10秒。',
      },
    ],
  },
  {
    content_id: 1629,
    title: '冰风迷途的勇士',
    effect: [
      {
        key: '两件套：',
        value: '获得15%冰元素伤害加成。',
      },
      {
        key: '四件套：',
        value:
          '攻击处于冰元素影响下的敌人时，暴击率提高20%；若敌人处于冻结状态下，则暴击率额外提高20%。',
      },
    ],
  },
  {
    content_id: 1607,
    title: '勇士之心',
    effect: [
      {
        key: '两件套：',
        value: '攻击力提高18%。',
      },
      {
        key: '四件套：',
        value: '对生命值高于50%的敌人，造成的伤害增加30%。',
      },
    ],
  },
  {
    content_id: 1606,
    title: '教官',
    effect: [
      {
        key: '两件套：',
        value: '元素精通提高80点。',
      },
      {
        key: '四件套：',
        value: '触发元素反应后，队伍中所有角色的元素精通提高120点，持续8秒。',
      },
    ],
  },
  {
    content_id: 1605,
    title: '流放者',
    effect: [
      {
        key: '两件套：',
        value: '元素充能效率提高20%。',
      },
      {
        key: '四件套：',
        value:
          '施放元素爆发后，每2秒为队伍中所有角色（不包括自己）恢复2点元素能量。该效果持续6秒，无法叠加。',
      },
    ],
  },
  {
    content_id: 1649,
    title: '祭冰之人',
    effect: [
      {
        key: '一件套：',
        value: '受到的冰元素附着效果的持续时间减少40%。',
      },
    ],
  },
  {
    content_id: 1646,
    title: '祭雷之人',
    effect: [
      {
        key: '一件套：',
        value: '受到的雷元素附着效果的持续时间减少40%。',
      },
    ],
  },
  {
    content_id: 1647,
    title: '祭火之人',
    effect: [
      {
        key: '一件套：',
        value: '受到的火元素附着效果的持续时间减少40%。',
      },
    ],
  },
  {
    content_id: 1648,
    title: '祭水之人',
    effect: [
      {
        key: '一件套：',
        value: '受到的水元素附着效果的持续时间减少40%。',
      },
    ],
  },
  {
    content_id: 1604,
    title: '战狂',
    effect: [
      {
        key: '两件套：',
        value: '暴击率提高12%。',
      },
      {
        key: '四件套：',
        value: '生命值低于70%时，暴击率额外提升24%。',
      },
    ],
  },
  {
    content_id: 1603,
    title: '武人',
    effect: [
      {
        key: '两件套：',
        value: '普通攻击与重击造成的伤害提高15%。',
      },
      {
        key: '四件套：',
        value: '释放元素战技后的8秒内，普通攻击和重击造成的伤害提升25%。',
      },
    ],
  },
  {
    content_id: 1599,
    title: '学士',
    effect: [
      {
        key: '两件套：',
        value: '元素充能效率提高20%。',
      },
      {
        key: '四件套：',
        value:
          '获得元素微粒或元素晶球时，队伍中所有弓箭和法器角色额外恢复3点元素能量。该效果每3秒只能触发一次。',
      },
    ],
  },
  {
    content_id: 1598,
    title: '赌徒',
    effect: [
      {
        key: '两件套：',
        value: '元素战技造成的伤害提升20%。',
      },
      {
        key: '四件套：',
        value:
          '打倒敌人时，有100%概率清除元素战技的冷却时间。该效果每15秒至多触发一次。',
      },
    ],
  },
  {
    content_id: 1597,
    title: '奇迹',
    effect: [
      {
        key: '两件套：',
        value: '所有元素抗性提高20%。',
      },
      {
        key: '四件套：',
        value:
          '受到某个元素类型的伤害后，相应的抗性提升30%，持续10秒。该效果每10秒只能触发一次。',
      },
    ],
  },
  {
    content_id: 1596,
    title: '行者之心',
    effect: [
      {
        key: '两件套：',
        value: '攻击力提高18%。',
      },
      {
        key: '四件套：',
        value: '重击的暴击率提升30%。',
      },
    ],
  },
  {
    content_id: 1595,
    title: '守护之心',
    effect: [
      {
        key: '两件套：',
        value: '防御力提高30%。',
      },
      {
        key: '四件套：',
        value:
          '队伍里每有不同一种元素类型的自己的角色，自身获得30%相应的元素抗性。',
      },
    ],
  },
  {
    content_id: 1645,
    title: '幸运儿',
    effect: [
      {
        key: '两件套：',
        value: '防御力提高100点。',
      },
      {
        key: '四件套：',
        value: '拾取摩拉时，恢复300点生命值。',
      },
    ],
  },
  {
    content_id: 1644,
    title: '冒险家',
    effect: [
      {
        key: '两件套：',
        value: '生命值上限提高1000点。',
      },
      {
        key: '四件套：',
        value: '开启各类宝箱后的5秒内，持续恢复30%生命值。',
      },
    ],
  },
  {
    content_id: 1643,
    title: '游医',
    effect: [
      {
        key: '两件套：',
        value: '角色受到的治疗效果提高20%。',
      },
      {
        key: '四件套：',
        value: '释放元素爆发时，恢复20%生命值。',
      },
    ],
  },
];