export const talentAttris = [
  {
    label: '一段伤害',
    value: '59.9%*2'
  },
  {
    label: '二段伤害',
    value: '115.0%'
  },
  {
    label: '三段伤害',
    value: '149.5%'
  },
  {
    label: '四段伤害',
    value: '78.1%*2'
  },
  {
    label: '五段伤害',
    value: '178.0%'
  },
  {
    label: '瞄准射击',
    value: '80.6%'
  },
  {
    label: '满蓄力瞄准射击',
    value: '211%'
  },
  {
    label: '焰硝矢伤害',
    value: '28%'
  },
  {
    label: '下坠期间伤害',
    value: '104.4%'
  },
  {
    label: '低空/高空坠地冲击伤害',
    value: '209%/261%'
  }
];
export const text = `$0普通攻击
进行至多五段的连续弓箭射击
    
$0重击
进行伤害更高、更为精准的$0瞄准射击。
瞄准时，火焰会在箭矢上持续积聚，并随攻击发射出去。根据蓄力时间长短，能造成不同的效果：
·一段蓄力：射出附有烈焰的箭矢，造成$1火元素伤害
·二段蓄力：依据蓄力时间，产生至多3枚焰硝矢，随宵宫这次瞄准射击释放。焰硝矢会自动追踪附近的敌人，并在命中时造成$1火元素伤害$。

$0下落攻击
从空中射出箭雨，并迅速下坠冲击地面，在落地时造成范围伤害。
`;