import { defineStore } from 'pinia';
import Naxida from '@/assets/avatar/sumeru/04007.png';

import type { CharacterInstanceBasicModel } from '@/interface/characters';

export const useCharacterLayoutStore = defineStore('character-layout', {
  state: () => ({
    // layout部分
    select: -1,
    sidebarStack: [] as string[],
    cRight: '',

    // 选中了哪个技能，哪个命之座
    talent: -1,
    lives: -1,

    // 已有角色列表，实例数据
    list: [
      {
        id: 1,
        character_id: 5111,
        lvl: 89,
        talents: [9, 9, 9],
        lives: 3
      }
    ] as unknown as CharacterInstanceBasicModel[],
    team: [] as number[],

    // 角色静态类数据
    clist: [
      {
        id: 1,
        uuid: 5111,
        basic: {
          name: '纳西妲',
          element: '草',
          star: 5,

          birth: '10月27日',
          belong: '须弥城',
          weapon: 3,
          life: '智慧主座',
          honor: '白草净华',

          avatar: Naxida
        },
        lvls: {
          attr: {
            '1': ['24', '807', '49'],
            '20': ['61', '2,092', '127'],
            '40': ['120', '4,165', '253'],
            '50': ['155', '5,357', '326'],
            '60': ['194', '6,721', '409'],
            '70': ['229', '7,926', '482'],
            '80': ['264', '9,140', '556'],
            '90': ['299', '10,360', '630'],
            '20+': ['81', '2,784', '169'],
            '40+': ['135', '4,656', '283'],
            '50+': ['174', '6,012', '366'],
            '60+': ['208', '7,212', '439'],
            '70+': ['243', '8,418', '512'],
            '80+': ['278', '9,632', '586']
          },
          breakthrough: '元素精通',
          material: {
            ele: '生长碧翡',
            boss: '灭诤草蔓',
            specialty: '劫波莲',
            drops: '孢囊晶尘'
          }
        },
        talents: [
          {
            type: '天赋1（普通攻击）',
            name: '普通攻击·行相',
            intro:
              '普通攻击\n对前方进行至多四段的攻击，造成草元素伤害。\n\n重击\n消耗一定体力，短暂咏唱后，对前方区域造成草元素范围伤害。\n\n下落攻击\n凝聚草元素的力量，从空中下坠冲击地面，攻击下落路径上的敌人，并在落地时造成草元素范围伤害。',
            detail: [
              {
                name: '一段伤害',
                data: [
                  '40.3%',
                  '43.3%',
                  '46.4%',
                  '50.4%',
                  '53.4%',
                  '56.4%',
                  '60.5%',
                  '64.5%',
                  '68.5%',
                  '72.5%',
                  '76.6%'
                ]
              },
              {
                name: '二段伤害',
                data: [
                  '37.0%',
                  '39.7%',
                  '42.5%',
                  '46.2%',
                  '49.0%',
                  '51.8%',
                  '55.5%',
                  '59.2%',
                  '62.9%',
                  '66.6%',
                  '70.3%'
                ]
              },
              {
                name: '三段伤害',
                data: [
                  '45.9%',
                  '49.3%',
                  '52.8%',
                  '57.3%',
                  '60.8%',
                  '64.2%',
                  '68.8%',
                  '73.4%',
                  '78.0%',
                  '82.6%',
                  '87.2%'
                ]
              },
              {
                name: '四段伤害',
                data: [
                  '58.4%',
                  '62.8%',
                  '67.2%',
                  '73.0%',
                  '77.4%',
                  '81.8%',
                  '87.6%',
                  '93.5%',
                  '99.3%',
                  '105.1%',
                  '111.0%'
                ]
              },
              {
                name: '重击伤害',
                data: [
                  '132.0%',
                  '141.9%',
                  '151.8%',
                  '165.0%',
                  '174.9%',
                  '184.8%',
                  '198.0%',
                  '211.2%',
                  '224.4%',
                  '237.6%',
                  '250.8%'
                ]
              },
              {
                name: '重击体力消耗',
                data: [
                  '50.0点',
                  '50.0点',
                  '50.0点',
                  '50.0点',
                  '50.0点',
                  '50.0点',
                  '50.0点',
                  '50.0点',
                  '50.0点',
                  '50.0点',
                  '50.0点'
                ]
              },
              {
                name: '下坠期间伤害',
                data: [
                  '56.8%',
                  '61.5%',
                  '66.1%',
                  '72.7%',
                  '77.3%',
                  '82.6%',
                  '89.9%',
                  '97.1%',
                  '104.4%',
                  '112.3%',
                  '120.3%'
                ]
              },
              {
                name: '低空/高空坠地冲击伤害',
                data: [
                  '114%/142%',
                  '123%/153%',
                  '132%/165%',
                  '145%/182%',
                  '155%/193%',
                  '165%/206%',
                  '180%/224%',
                  '194%/243%',
                  '209%/261%',
                  '225%/281%',
                  '240%/300%'
                ]
              }
            ]
          },
          {
            type: '天赋2（元素战技）',
            name: '所闻遍计',
            intro:
              '在身边施以草木之业缚，造成草元素范围伤害，并对命中的至多8名敌人施加蕴种印。\n长按时将以不同的方式施放。\n\n长按\n进入瞄准状态，以选定一定范围内一定数量的敌人，并在该状态下提高纳西妲的抗打断能力。\n长按结束时，对选定的敌人造成草元素伤害，并为其施加蕴种印。\n瞄准状态至多持续5秒，至多选定8名敌人。\n\n蕴种印\n处于蕴种印状态下的敌人将在一定距离内互相连结。\n对处于蕴种印状态下的敌人触发元素反应，以及在该敌人受到草原核（包含烈绽放、超绽放）造成的伤害后，纳西妲将基于攻击力与元素精通，对该敌人及其所处连结中的所有敌人释放灭净三业，造成草元素伤害。\n短时间内至多触发一次灭净三业。\n\n草木之神既已于空藏中照见诸法实相，乃可究尽三际因缘起灭之机。',
            detail: [
              {
                name: '点按伤害',
                data: [
                  '98.4%',
                  '105.8%',
                  '113.2%',
                  '123.0%',
                  '130.4%',
                  '137.8%',
                  '147.6%',
                  '157.4%',
                  '167.3%',
                  '177.1%',
                  '187.0%',
                  '196.8%',
                  '209.1%'
                ]
              },
              {
                name: '长按伤害',
                data: [
                  '130.4%',
                  '140.2%',
                  '150.0%',
                  '163.0%',
                  '172.8%',
                  '182.6%',
                  '195.6%',
                  '208.6%',
                  '221.7%',
                  '234.7%',
                  '247.8%',
                  '260.8%',
                  '277.1%'
                ]
              },
              {
                name: '灭净三业伤害',
                data: [
                  '103.2%攻击力+206.4%元素精通',
                  '110.9%攻击力+221.9%元素精通',
                  '118.7%攻击力+237.4%元素精通',
                  '129.0%攻击力+258.0%元素精通',
                  '136.7%攻击力+273.5%元素精通',
                  '144.5%攻击力+289.0%元素精通',
                  '154.8%攻击力+309.6%元素精通',
                  '165.1%攻击力+330.2%元素精通',
                  '175.4%攻击力+350.9%元素精通',
                  '185.8%攻击力+371.5%元素精通',
                  '196.1%攻击力+392.2%元素精通',
                  '206.4%攻击力+412.8%元素精通',
                  '219.3%攻击力+438.6%元素精通'
                ]
              },
              {
                name: '灭净三业触发间隔',
                data: [
                  '2.5秒',
                  '2.5秒',
                  '2.5秒',
                  '2.5秒',
                  '2.5秒',
                  '2.5秒',
                  '2.5秒',
                  '2.5秒',
                  '2.5秒',
                  '2.5秒',
                  '2.5秒',
                  '2.5秒',
                  '2.5秒'
                ]
              },
              {
                name: '蕴种印持续时间',
                data: [
                  '25.0秒',
                  '25.0秒',
                  '25.0秒',
                  '25.0秒',
                  '25.0秒',
                  '25.0秒',
                  '25.0秒',
                  '25.0秒',
                  '25.0秒',
                  '25.0秒',
                  '25.0秒',
                  '25.0秒',
                  '25.0秒'
                ]
              },
              {
                name: '点按冷却时间',
                data: [
                  '5.0秒',
                  '5.0秒',
                  '5.0秒',
                  '5.0秒',
                  '5.0秒',
                  '5.0秒',
                  '5.0秒',
                  '5.0秒',
                  '5.0秒',
                  '5.0秒',
                  '5.0秒',
                  '5.0秒',
                  '5.0秒'
                ]
              },
              {
                name: '长按冷却时间',
                data: [
                  '6.0秒',
                  '6.0秒',
                  '6.0秒',
                  '6.0秒',
                  '6.0秒',
                  '6.0秒',
                  '6.0秒',
                  '6.0秒',
                  '6.0秒',
                  '6.0秒',
                  '6.0秒',
                  '6.0秒',
                  '6.0秒'
                ]
              }
            ]
          },
          {
            type: '天赋3（元素爆发）',
            name: '心景幻成',
            intro:
              '将梦想的殿堂具现，展开「摩耶之殿」领域。\n\n领域展开时，队伍中若存在以下元素类型的角色，将分别产生对应的效果：\n·火元素：当纳西妲处于摩耶之殿当中时，提升元素战技「所闻遍计」的灭净三业造成的伤害；\n·雷元素：当纳西妲处于摩耶之殿当中时，降低元素战技「所闻遍计」的灭净三业触发的间隔时间；\n·水元素：延长摩耶之殿的持续时间。\n\n展开领域时，若上述元素类型的角色数量有至少2名，产生的对应效果将进一步增强。\n\n纳西妲即使处于队伍后台，只要该队伍处于摩耶之殿当中，依旧能获得上述效果的提升。\n\n在智慧之神的眼中，或许森罗万象也不过是颠倒幻成的摩耶之梦。',
            detail: [
              {
                name: '火：伤害提升',
                data: [
                  '1名角色14.9%',
                  '1名角色16.0%',
                  '1名角色17.1%',
                  '1名角色18.6%',
                  '1名角色19.7%',
                  '1名角色20.8%',
                  '1名角色22.3%',
                  '1名角色23.8%',
                  '1名角色25.3%',
                  '1名角色26.8%',
                  '1名角色28.27%',
                  '1名角色29.8%',
                  '1名角色31.6%'
                ]
              },
              {
                name: '火：伤害提升',
                data: [
                  '2名角色22.3%',
                  '2名角色24.0%',
                  '2名角色25.7%',
                  '2名角色27.9%',
                  '2名角色29.6%',
                  '2名角色31.3%',
                  '2名角色33.5%',
                  '2名角色35.7%',
                  '2名角色37.9%',
                  '2名角色40.2%',
                  '2名角色42.41%',
                  '2名角色44.6%',
                  '2名角色47.4%'
                ]
              },
              {
                name: '雷：间隔降低',
                data: [
                  '1名角色0.25秒',
                  '1名角色0.27秒',
                  '1名角色0.29秒',
                  '1名角色0.31秒',
                  '1名角色0.33秒',
                  '1名角色0.35秒',
                  '1名角色0.37秒',
                  '1名角色0.4秒',
                  '1名角色0.42秒',
                  '1名角色0.45秒',
                  '1名角色0.47秒',
                  '1名角色0.50秒',
                  '1名角色0.53秒'
                ]
              },
              {
                name: '雷：间隔降低',
                data: [
                  '2名角色0.37秒',
                  '2名角色0.4秒',
                  '2名角色0.43秒',
                  '2名角色0.47秒',
                  '2名角色0.49秒',
                  '2名角色0.52秒',
                  '2名角色0.56秒',
                  '2名角色0.6秒',
                  '2名角色0.63秒',
                  '2名角色0.67秒',
                  '2名角色0.7秒',
                  '2名角色0.74秒',
                  '2名角色0.79秒'
                ]
              },
              {
                name: '水：持续时间延长',
                data: [
                  '1名角色3.34秒',
                  '1名角色3.59秒',
                  '1名角色3.85秒',
                  '1名角色4.18秒',
                  '1名角色4.43秒',
                  '1名角色4.68秒',
                  '1名角色5.02秒',
                  '1名角色5.35秒',
                  '1名角色5.68秒',
                  '1名角色6.02秒',
                  '1名角色6.35秒',
                  '1名角色6.69秒',
                  '1名角色7.11秒'
                ]
              },
              {
                name: '水：持续时间延长',
                data: [
                  '2名角色5.02秒',
                  '2名角色5.39秒',
                  '2名角色5.77秒',
                  '2名角色6.27秒',
                  '2名角色6.65秒',
                  '2名角色7.02秒',
                  '2名角色7.52秒',
                  '2名角色8.03秒',
                  '2名角色8.53秒',
                  '2名角色9.03秒',
                  '2名角色9.53秒',
                  '2名角色10.03秒',
                  '2名角色10.66秒'
                ]
              },
              {
                name: '基础持续时间',
                data: [
                  '15.0秒',
                  '15.0秒',
                  '15.0秒',
                  '15.0秒',
                  '15.0秒',
                  '15.0秒',
                  '15.0秒',
                  '15.0秒',
                  '15.0秒',
                  '15.0秒',
                  '15.0秒',
                  '15.0秒',
                  '15.0秒'
                ]
              },
              {
                name: '冷却时间',
                data: [
                  '13.5秒',
                  '13.5秒',
                  '13.5秒',
                  '13.5秒',
                  '13.5秒',
                  '13.5秒',
                  '13.5秒',
                  '13.5秒',
                  '13.5秒',
                  '13.5秒',
                  '13.5秒',
                  '13.5秒',
                  '13.5秒'
                ]
              },
              {
                name: '元素能量',
                data: ['50', '50', '50', '50', '50', '50', '50', '50', '50', '50', '50', '50', '50']
              }
            ]
          },
          {
            type: '天赋4（固有天赋）',
            name: '净善摄受明论',
            intro:
              '施放心景幻成时，摩耶之殿将获得以下效果：\n依据队伍中元素精通最高的角色的元素精通数值的25%，提高领域内当前场上角色的元素精通。\n通过这种方式，至多提升250点元素精通。',
            detail: []
          },
          {
            type: '天赋5（固有天赋）',
            name: '慧明缘觉智论',
            intro:
              '基于纳西妲元素精通超过200点的部分，每1点元素精通能使所闻遍计的灭净三业造成的伤害提升0.1%，暴击率提升0.03%。\n通过这种方式，至多使灭净三业造成的伤害提升80%，暴击率提升24%。',
            detail: []
          },
          {
            type: '天赋6（固有天赋）',
            name: '诸相随念净行',
            intro:
              '纳西妲能够通过所闻遍计，与一定范围内的部分采集物进行交互。\n或许还有其他的效果…',
            detail: []
          }
        ],
        life: [
          {
            name: '心识蕴藏之种',
            desc: '展开摩耶之殿计算队伍中特定元素类型的角色数量时，额外计入火元素、雷元素、水元素的角色各1名。'
          },
          {
            name: '正等善见之根',
            desc: '处于纳西妲自身施加的蕴种印状态下的敌人，将受到以下效果影响：·燃烧、绽放、超绽放、烈绽放反应伤害能够造成暴击，暴击率固定为20%，暴击伤害固定为100%；·受到原激化、超激化、蔓激化反应影响后的8秒内，防御力降低30%。'
          },
          {
            name: '熏习成就之芽',
            desc: '所闻遍计的技能等级提高3级。至多提升至15级。'
          },
          {
            name: '比量现行之茎',
            desc: '附近处于所闻遍计的蕴种印状态下的敌人数量为1/2/3/4或更多时，纳西妲的元素精通提升100/120/140/160点。'
          },
          {
            name: '妙谛破愚之叶',
            desc: '心景幻成的技能等级提高3级。至多提升至15级。'
          },
          {
            name: '大辨圆成之实',
            desc: '施放心景幻成后，纳西妲的普通攻击或重击命中处于所闻遍计的蕴种印状态下的敌人时，将对该敌人及其所处连结中的所有敌人释放灭净三业·业障除，基于纳西妲攻击力的200%与元素精通的400%，造成草元素伤害。灭净三业·业障除造成的伤害视为元素战技伤害，每0.2秒至多触发一次。该效果至多持续10秒，将在纳西妲释放6次灭净三业·业障除后移除。'
          }
        ]
      }
    ]
  }),
  getters: {
    sidebar(state) {
      return state.sidebarStack[state.sidebarStack.length - 1] || '';
    },
    character(state) {
      return (
        state.list.find((c) => c.id === state.select) ?? {
          id: -1,
          character_id: -1,
          lvl: 1,
          talents: [1, 1, 1],
          lives: 0
        }
      );
    },
    // 静态角色数据
    characterStatic(state) {
      const cIns = state.list.find((c) => c.id === state.select);

      if (!cIns) return;

      return state.clist.find((c) => c.uuid === cIns.character_id);
    }
  },
  actions: {
    // 设置角色列表当前选中的id
    setSelect(select: number) {
      const index = this.list.findIndex((l) => l.id === select);
      if (index !== -1) {
        this.select = select;
      } else if (this.list.length && this.team.length) {
        this.select = this.list.find((l) => l.id === this.team[0])?.id || -1;
      } else {
        this.select = this.list.length ? this.list[0].id : -1;
      }
    },
    setTalent(talent: number) {
      this.talent = talent;
    },
    setLives(lives: number) {
      this.lives = lives;
    },
    setInTeam(inTeam: number[]) {
      this.team = [...inTeam];
    },
    setRight(right: string) {
      this.cRight = right;
    },
    pushSidebar(sidebar: string) {
      this.sidebarStack.push(sidebar);
    },
    popSidebar() {
      this.sidebarStack.pop();
    }
  }
});
